# CurveIsSlopeDefining Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveIsSlopeDefining Property
ParameterTypeId Class See Also
---
"Defines Slope"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveIsSlopeDefining { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveIsSlopeDefining As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveIsSlopeDefining {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace